In [5]:
import pandas as pd
import numpy as np

In [15]:
print(pd.__version__)

0.24.2

In [20]:
#Create pandas series from python array

python_ar = [1,2,3,4,5,6,7,8,9]
print(type(python_ar))
pandas_series_1 = pd.Series(python_ar)
print(type(pandas_series_1))
print(pandas_series_1)

<class 'list'>
<class 'pandas.core.series.Series'>
0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [21]:
#Create pandas series from numpy array

numpy_ar = np.array([1,2,3,4,5,6,7,8,9])
print(type(numpy_ar))
pandas_series_2 = pd.Series(python_ar)
print(type(pandas_series_2))
print(pandas_series_2)

<class 'numpy.ndarray'>
<class 'pandas.core.series.Series'>
0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [26]:
#Create pandas series from python dictionary
python_dict = {'x':1 , 'y':2 , 'z':3 , 't':4 , 'u':5}
print(type(python_dict))
pandas_series_3 = pd.Series(python_dict)
print(type(pandas_series_3))
print(pandas_series_3)

<class 'dict'>
<class 'pandas.core.series.Series'>
x    1
y    2
z    3
t    4
u    5
dtype: int64

Modify the index of series

In [27]:
print(pandas_series_3)
pandas_series_3.index = ['a','b','c','d','e']
print(pandas_series_3)

x    1
y    2
z    3
t    4
u    5
dtype: int64
a    1
b    2
c    3
d    4
e    5
dtype: int64

In [47]:
#Determine the indexes before creating the series
np_ar = np.random.randn(5)
print(np_ar)
indexes = ['a','b','c','d','e']
pandas_series_4 = pd.Series(np_ar , index = indexes)
print(pandas_series_4)

[ 0.03586688  0.52795452  0.67020778 -0.96996336 -2.31472421]
a    0.035867
b    0.527955
c    0.670208
d   -0.969963
e   -2.314724
dtype: float64

In [49]:
np_ar_2 = np.array([1,2,3,4,5])
indexes_1 = ['a','b','c','d','e']
serie_1 = pd.Series(np_ar_2 , index=indexes_1)
serie_1

a    1
b    2
c    3
d    4
e    5
dtype: int32

In [50]:
np_ar_3 = np.array([7,8,9,10,11])
indexes_2 = ['A','B','C','D','E']
serie_2 = pd.Series(np_ar_3 , index=indexes_2)
serie_2

A     7
B     8
C     9
D    10
E    11
dtype: int32

In [51]:
serie_3 = serie_1.append(serie_2)
serie_3

a     1
b     2
c     3
d     4
e     5
A     7
B     8
C     9
D    10
E    11
dtype: int32

In [52]:
serie_3[3:8]

d    4
e    5
A    7
B    8
C    9
dtype: int32

In [53]:
serie_3 = serie_3.drop('A')
serie_3

a     1
b     2
c     3
d     4
e     5
B     8
C     9
D    10
E    11
dtype: int32

Adding,multiplication,substraction and division

In [71]:
ar_1 = np.array([1,2,3,4,5,6,7] , dtype='int16')
ar_2 = np.array([7,8,9,10,11,12,0] , dtype='int16')

In [72]:
se_1 = pd.Series(ar_1)
se_2 = pd.Series(ar_2)

In [73]:
res_1 = se_1.add(se_2)
res_1

0     8
1    10
2    12
3    14
4    16
5    18
6     7
dtype: int16

In [74]:
res_2 = se_1.sub(se_2)
res_2

0   -6
1   -6
2   -6
3   -6
4   -6
5   -6
6    7
dtype: int16

In [75]:
res_3 = se_1.mul(se_2)
res_3

0     7
1    16
2    27
3    40
4    55
5    72
6     0
dtype: int16

In [76]:
res_4 = se_1.div(se_2)
res_4

0    0.142857
1    0.250000
2    0.333333
3    0.400000
4    0.454545
5    0.500000
6         inf
dtype: float64

In [77]:
res_5 = se_2.div(se_1)
res_5

0    7.0
1    4.0
2    3.0
3    2.5
4    2.2
5    2.0
6    0.0
dtype: float64

In [78]:
se_3 = se_1.append(se_2)
se_3

0     1
1     2
2     3
3     4
4     5
5     6
6     7
0     7
1     8
2     9
3    10
4    11
5    12
6     0
dtype: int16

In [82]:
print('Median:',se_3.median())
print('Max:',se_3.max())
print('Min:',se_3.min())

Median: 6.5
Max: 12
Min: 0

Creating dataframe

In [85]:
indexes = ['a','b','c','d','e','f','g','h','i']
np_arr = np.random.randn(9,4)
columns = ['Column_1' , 'Column_2' , 'Column_3' , 'Column_4']
df = pd.DataFrame(np_arr , index=indexes , columns=columns)
df

   Column_1  Column_2  Column_3  Column_4
a  0.729847  0.478540 -1.331124  1.899670
b -0.628920 -1.475016 -0.106197  0.514508
c  1.743491  2.090228 -1.473017 -0.308250
d -1.015595 -0.243613  0.546031 -0.983297
e  0.486524  0.139452  0.527417  0.949829
f -1.072794 -0.121689  0.327026 -0.492570
g  0.060675  1.331967  0.770137 -0.132365
h  0.040686  0.205737  1.208358 -0.483403
i -0.474163 -0.196205 -1.031054 -1.464133

In [89]:
#Create dataframe from dictonary

data = {'Course name':   ['Machine Learning','Digital image proccesing' ,'Data mining' , 'Python programming' , 'Natural language proccesing' , 'Data Structures' , 'Artificial intelliegence'],
         'Course Credit':   [  6 , 6,  4,       np.nan,   5 ,      4,     3 ],
         'Semester ID':  [  2,    1,      1       ,np.nan     ,1,       1      ,2 ],
         'Lecturer':['Dr. Martinez', 'Prof. Dr. Salah', 'Dr. Muller','Dr. Kimmich' , 'Dr. Martinez','Dr. Neuer' ,'Prof. Dr. Salah']}
labels = ['a','b','c','d','e','f','g',]

df_2 = pd.DataFrame(data , index=labels)
df_2

                   Course name  Course Credit  Semester ID         Lecturer
a             Machine Learning            6.0          2.0     Dr. Martinez
b     Digital image proccesing            6.0          1.0  Prof. Dr. Salah
c                  Data mining            4.0          1.0       Dr. Muller
d           Python programming            NaN          NaN      Dr. Kimmich
e  Natural language proccesing            5.0          1.0     Dr. Martinez
f              Data Structures            4.0          1.0        Dr. Neuer
g     Artificial intelliegence            3.0          2.0  Prof. Dr. Salah

In [90]:
df_2.dtypes

Course name       object
Course Credit    float64
Semester ID      float64
Lecturer          object
dtype: object

In [152]:
df_2.head()

                   Course name  Course Credit  Semester ID         Lecturer
a             Machine Learning            6.0          2.0     Dr. Martinez
b     Digital image proccesing            6.0          1.0  Prof. Dr. Salah
c                  Data mining            4.0          1.0       Dr. Muller
d              Pandas tutorial            NaN          NaN      Dr. Kimmich
e  Natural language proccesing            5.0          1.0     Dr. Martinez

In [91]:
#returns first n element that you determine
df_3 = df_2.head(3)
df_3

                Course name  Course Credit  Semester ID         Lecturer
a          Machine Learning            6.0          2.0     Dr. Martinez
b  Digital image proccesing            6.0          1.0  Prof. Dr. Salah
c               Data mining            4.0          1.0       Dr. Muller

In [93]:
#returns last n element that you determine
df_4 = df_2.tail(3)
df_4

                   Course name  Course Credit  Semester ID         Lecturer
e  Natural language proccesing            5.0          1.0     Dr. Martinez
f              Data Structures            4.0          1.0        Dr. Neuer
g     Artificial intelliegence            3.0          2.0  Prof. Dr. Salah

In [94]:
print(df_2.index)
print(df_2.columns)

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')
Index(['Course name', 'Course Credit', 'Semester ID', 'Lecturer'], dtype='object')

In [95]:
df_2.values

array([['Machine Learning', 6.0, 2.0, 'Dr. Martinez'],
       ['Digital image proccesing', 6.0, 1.0, 'Prof. Dr. Salah'],
       ['Data mining', 4.0, 1.0, 'Dr. Muller'],
       ['Python programming', nan, nan, 'Dr. Kimmich'],
       ['Natural language proccesing', 5.0, 1.0, 'Dr. Martinez'],
       ['Data Structures', 4.0, 1.0, 'Dr. Neuer'],
       ['Artificial intelliegence', 3.0, 2.0, 'Prof. Dr. Salah']],
      dtype=object)

In [96]:
df_2.describe()

       Course Credit  Semester ID
count       6.000000     6.000000
mean        4.666667     1.333333
std         1.211060     0.516398
min         3.000000     1.000000
25%         4.000000     1.000000
50%         4.500000     1.000000
75%         5.750000     1.750000
max         6.000000     2.000000

In [98]:
df_2.T #Take tranpose of the dataframe

,a,b,c,d,e,f,g
Course name,Machine Learning,Digital image proccesing,Data mining,Python programming,Natural language proccesing,Data Structures,Artificial intelliegence
Course Credit,6,6,4,NaN,5,4,3
Semester ID,2,1,1,NaN,1,1,2
Lecturer,Dr. Martinez,Prof. Dr. Salah,Dr. Muller,Dr. Kimmich,Dr. Martinez,Dr. Neuer,Prof. Dr. Salah

In [99]:
df_2.sort_values(by='Course Credit')

                   Course name  Course Credit  Semester ID         Lecturer
g     Artificial intelliegence            3.0          2.0  Prof. Dr. Salah
c                  Data mining            4.0          1.0       Dr. Muller
f              Data Structures            4.0          1.0        Dr. Neuer
e  Natural language proccesing            5.0          1.0     Dr. Martinez
a             Machine Learning            6.0          2.0     Dr. Martinez
b     Digital image proccesing            6.0          1.0  Prof. Dr. Salah
d           Python programming            NaN          NaN      Dr. Kimmich

In [100]:
#Slicing dataframe
df_2[2:5]

                   Course name  Course Credit  Semester ID      Lecturer
c                  Data mining            4.0          1.0    Dr. Muller
d           Python programming            NaN          NaN   Dr. Kimmich
e  Natural language proccesing            5.0          1.0  Dr. Martinez

In [102]:
df_2[2:5].sort_values(by='Course Credit')
#df_2.sort_values(by='Course Credit')[2:5]

                   Course name  Course Credit  Semester ID      Lecturer
c                  Data mining            4.0          1.0    Dr. Muller
e  Natural language proccesing            5.0          1.0  Dr. Martinez
d           Python programming            NaN          NaN   Dr. Kimmich

In [103]:
#Take specific column or column from dataframe
df_2[['Course name','Lecturer']]

                   Course name         Lecturer
a             Machine Learning     Dr. Martinez
b     Digital image proccesing  Prof. Dr. Salah
c                  Data mining       Dr. Muller
d           Python programming      Dr. Kimmich
e  Natural language proccesing     Dr. Martinez
f              Data Structures        Dr. Neuer
g     Artificial intelliegence  Prof. Dr. Salah

In [104]:
df_2.iloc[2:5]

                   Course name  Course Credit  Semester ID      Lecturer
c                  Data mining            4.0          1.0    Dr. Muller
d           Python programming            NaN          NaN   Dr. Kimmich
e  Natural language proccesing            5.0          1.0  Dr. Martinez

In [108]:
df_2.loc['d','Course name']

'Python programming'

In [110]:
df_2.loc['d','Course name'] = 'Pandas tutorial'
df_2.loc['d','Course name']

'Pandas tutorial'

In [111]:
df_2

                   Course name  Course Credit  Semester ID         Lecturer
a             Machine Learning            6.0          2.0     Dr. Martinez
b     Digital image proccesing            6.0          1.0  Prof. Dr. Salah
c                  Data mining            4.0          1.0       Dr. Muller
d              Pandas tutorial            NaN          NaN      Dr. Kimmich
e  Natural language proccesing            5.0          1.0     Dr. Martinez
f              Data Structures            4.0          1.0        Dr. Neuer
g     Artificial intelliegence            3.0          2.0  Prof. Dr. Salah

In [112]:
df_2.isnull()

   Course name  Course Credit  Semester ID  Lecturer
a        False          False        False     False
b        False          False        False     False
c        False          False        False     False
d        False           True         True     False
e        False          False        False     False
f        False          False        False     False
g        False          False        False     False

In [124]:
df_2['Course Credit']

a    6.0
b    6.0
c    4.0
d    NaN
e    5.0
f    4.0
g    3.0
Name: Course Credit, dtype: float64

In [125]:
df_2['Course Credit'].mean()

4.666666666666667

In [127]:
mean_cc = df_2['Course Credit'].mean()
df_2['Course Credit'].fillna(mean_cc)

a    6.000000
b    6.000000
c    4.000000
d    4.666667
e    5.000000
f    4.000000
g    3.000000
Name: Course Credit, dtype: float64

In [128]:
df_2.mean()

Course Credit    4.666667
Semester ID      1.333333
dtype: float64

In [129]:
df_2['Course Credit'].sum()

28.0

In [130]:
df_2['Course Credit'].max()

6.0

In [131]:
df_2['Course Credit'].min()

3.0

In [132]:
df_2.sum()

Course name      Machine LearningDigital image proccesingData m...
Course Credit                                                   28
Semester ID                                                      8
Lecturer         Dr. MartinezProf. Dr. SalahDr. MullerDr. Kimmi...
dtype: object

In [133]:
df_2['Lecturer']

a       Dr. Martinez
b    Prof. Dr. Salah
c         Dr. Muller
d        Dr. Kimmich
e       Dr. Martinez
f          Dr. Neuer
g    Prof. Dr. Salah
Name: Lecturer, dtype: object

In [134]:
df_2['Lecturer'].str.lower()

a       dr. martinez
b    prof. dr. salah
c         dr. muller
d        dr. kimmich
e       dr. martinez
f          dr. neuer
g    prof. dr. salah
Name: Lecturer, dtype: object

In [135]:
df_2['Lecturer'].str.upper()

a       DR. MARTINEZ
b    PROF. DR. SALAH
c         DR. MULLER
d        DR. KIMMICH
e       DR. MARTINEZ
f          DR. NEUER
g    PROF. DR. SALAH
Name: Lecturer, dtype: object

In [136]:
df_2.dropna(how='any') #if we do not assign the result any variable, the process will be meaningless as we see in the result

                   Course name  Course Credit  Semester ID         Lecturer
a             Machine Learning            6.0          2.0     Dr. Martinez
b     Digital image proccesing            6.0          1.0  Prof. Dr. Salah
c                  Data mining            4.0          1.0       Dr. Muller
e  Natural language proccesing            5.0          1.0     Dr. Martinez
f              Data Structures            4.0          1.0        Dr. Neuer
g     Artificial intelliegence            3.0          2.0  Prof. Dr. Salah

In [137]:
df_2

                   Course name  Course Credit  Semester ID         Lecturer
a             Machine Learning            6.0          2.0     Dr. Martinez
b     Digital image proccesing            6.0          1.0  Prof. Dr. Salah
c                  Data mining            4.0          1.0       Dr. Muller
d              Pandas tutorial            NaN          NaN      Dr. Kimmich
e  Natural language proccesing            5.0          1.0     Dr. Martinez
f              Data Structures            4.0          1.0        Dr. Neuer
g     Artificial intelliegence            3.0          2.0  Prof. Dr. Salah

File operations

In [140]:
#Write to csv file
df_2.to_csv('courses.csv')

In [141]:
#Read from csv file
file_data_1 = pd.read_csv('courses.csv') 
file_data_1

,Unnamed: 0,Course name,Course Credit,Semester ID,Lecturer
0,a,Machine Learning,6.0,2.0,Dr. Martinez
1,b,Digital image proccesing,6.0,1.0,Prof. Dr. Salah
2,c,Data mining,4.0,1.0,Dr. Muller
3,d,Pandas tutorial,NaN,NaN,Dr. Kimmich
4,e,Natural language proccesing,5.0,1.0,Dr. Martinez
5,f,Data Structures,4.0,1.0,Dr. Neuer
6,g,Artificial intelliegence,3.0,2.0,Prof. Dr. Salah

In [144]:
#Write to excel file
df_2.to_excel('courses.xlsx' , sheet_name="Sheet1")

In [6]:
#Read from xlsx file
file_data_2 = pd.read_excel('courses.xlsx' , 'Sheet1' , index_col=None , na_values=['NA']) 
file_data_2

,Unnamed: 0,Course name,Course Credit,Semester ID,Lecturer
0,a,Machine Learning,6.0,2.0,Dr. Martinez
1,b,Digital image proccesing,6.0,1.0,Prof. Dr. Salah
2,c,Data mining,4.0,1.0,Dr. Muller
3,d,Pandas tutorial,NaN,NaN,Dr. Kimmich
4,e,Natural language proccesing,5.0,1.0,Dr. Martinez
5,f,Data Structures,4.0,1.0,Dr. Neuer
6,g,Artificial intelliegence,3.0,2.0,Prof. Dr. Salah

In [8]:
file_data_2.drop(['Semester ID' , 'Lecturer'] , axis=1).head()

  Unnamed: 0                  Course name  Course Credit
0          a             Machine Learning            6.0
1          b     Digital image proccesing            6.0
2          c                  Data mining            4.0
3          d              Pandas tutorial            NaN
4          e  Natural language proccesing            5.0

In [146]:
df_2['Semester ID']

a    2.0
b    1.0
c    1.0
d    NaN
e    1.0
f    1.0
g    2.0
Name: Semester ID, dtype: float64

In [168]:
df_2.groupby(['Lecturer' , 'Course name']).sum()#to show only grouping function

                                             Course Credit  Semester ID
Lecturer        Course name
Dr. Kimmich     Pandas tutorial                        0.0          0.0
Dr. Martinez    Machine Learning                       6.0          2.0
                Natural language proccesing            5.0          1.0
Dr. Muller      Data mining                            4.0          1.0
Dr. Neuer       Data Structures                        4.0          1.0
Prof. Dr. Salah Artificial intelliegence               3.0          2.0
                Digital image proccesing               6.0          1.0

In [147]:
df_2['Semester ID'].cumsum() # cumulative sum

a    2.0
b    3.0
c    4.0
d    NaN
e    5.0
f    6.0
g    8.0
Name: Semester ID, dtype: float64